In [16]:
import pandas as pd
course_name = ["Data Science", "Machine Learning", "Big Data","Data Engineer"]
duration = [2,3,6,4]
df = pd.DataFrame(data = {"course_name" : course_name, 'duration' : duration})

In [17]:
df

        course_name  duration
0      Data Science         2
1  Machine Learning         3
2          Big Data         6
3     Data Engineer         4

Q1

In [18]:
df.head()[1:2]

        course_name  duration
1  Machine Learning         3

In [19]:
print(df.iloc[1])

course_name    Machine Learning
duration                      3
Name: 1, dtype: object

Q2. What is the difference between the functions loc and iloc in pandas.DataFrame?

Both loc and iloc are used to select rows and columns from a pandas DataFrame, but they differ in how they use the row and column indices.

loc is used for label-based indexing, where you can select rows and columns using the labels (names) of the rows and columns. You can use either single label or a list of labels to select rows, and a single label or a list of labels to select columns.

iloc is used for integer-based indexing, where you can select rows and columns using the integer indices of the rows and columns. You can use either single integer or a list of integers to select rows, and a single integer or a list of integers to select columns.

Q3.

Q3. Reindex the given dataframe using a variable, reindex = [3,0,1,2] and store it in the variable, new_df
then find the output for both new_df.loc[2] and new_df.iloc[2]

In [20]:
new_df = df.reindex([3,0,1,2])

In [21]:
new_df

        course_name  duration
3     Data Engineer         4
0      Data Science         2
1  Machine Learning         3
2          Big Data         6

In [22]:
new_df.loc[2]

course_name    Big Data
duration              6
Name: 2, dtype: object

In [23]:
new_df.iloc[2]

course_name    Machine Learning
duration                      3
Name: 1, dtype: object

The reason for this difference in output is that loc() uses the labels of the rows to locate the data, while iloc() uses the integer positions of the rows. Since the order of rows in new_df is different from the order of rows in df, the labels and integer positions of the rows are also different. Therefore, loc() and iloc() methods retrieve different rows of data from the dataframe.

In [24]:
import pandas as pd
import numpy as np
columns = ['column_1', 'column_2', 'column_3', 'column_4', 'column_5', 'column_6']
indices = [1,2,3,4,5,6]
#Creating a dataframe:
df1 = pd.DataFrame(np.random.rand(6,6), columns = columns, index = indices)

In [25]:
df1

   column_1  column_2  column_3  column_4  column_5  column_6
1  0.171071  0.952985  0.842074  0.861312  0.338278  0.368123
2  0.549891  0.390442  0.757853  0.526153  0.529313  0.738606
3  0.285441  0.320618  0.234125  0.362792  0.840184  0.449587
4  0.125801  0.595851  0.096844  0.312963  0.702478  0.888423
5  0.632465  0.958133  0.851730  0.717282  0.302373  0.418350
6  0.425410  0.355260  0.514118  0.037004  0.877874  0.931101

Q4

In [26]:
df1.head().mean()

column_1    0.352934
column_2    0.643606
column_3    0.556525
column_4    0.556100
column_5    0.542525
column_6    0.572618
dtype: float64

In [27]:
df1.head()['column_2'].std()

0.30221527137832815

Q5. Replace the data present in the second row of column, ‘column_2’ by a string variable then find the
mean of column, column_2.
If you are getting errors in executing it then explain why.
[Hint: To replace the data use df1.loc[] and equate this to string data of your choice.]

In [28]:
df1

   column_1  column_2  column_3  column_4  column_5  column_6
1  0.171071  0.952985  0.842074  0.861312  0.338278  0.368123
2  0.549891  0.390442  0.757853  0.526153  0.529313  0.738606
3  0.285441  0.320618  0.234125  0.362792  0.840184  0.449587
4  0.125801  0.595851  0.096844  0.312963  0.702478  0.888423
5  0.632465  0.958133  0.851730  0.717282  0.302373  0.418350
6  0.425410  0.355260  0.514118  0.037004  0.877874  0.931101

In [29]:
df1.loc[2, 'column_2'] = 'saqib'

df1['column_2'].mean

there are errors while executing this code, it may be because the string data cannot be used in calculations like mean(). In that case, we need to convert the data in the column to a numeric format using the astype()

Q6. What do you understand about the windows function in pandas and list the types of windows
functions?

In pandas, a window function is a way to perform calculations over a sliding window of data, where the size and shape of the window can be customized. Window functions are typically used in time-series data analysis and are also useful for various statistical and data analysis tasks.

The types of window functions available in pandas are:

Rolling: This function is used to perform rolling window calculations. The size of the window can be specified, and different types of calculations can be performed on the data in the window, such as sum, mean, median, etc.

Expanding: This function is used to perform expanding window calculations. In this type of window function, the window size starts from a minimum value and expands to include more data points over time. This function is useful for calculating cumulative quantities such as cumulative sum, cumulative product, etc.

EWM (Exponentially Weighted Moving): This function is used to perform exponentially weighted moving window calculations. This type of window function applies more weight to the recent data points in the window, making it more responsive to changes in the data.
All these window functions are available in the pandas library and can be applied to various types of data analysis tasks.

Q7

In [31]:
import datetime
now = datetime.datetime.now()

In [32]:
now.strftime("%B %Y")

'February 2023'

Q8. Write a Python program that takes in two dates as input (in the format YYYY-MM-DD) and
calculates the difference between them in days, hours, and minutes using Pandas time delta. The
program should prompt the user to enter the dates and display the result.

In [ ]:
date1_str = input("Enter the first date in YYYY-MM-DD format: ")

date2_str = input("Enter the second date in YYYY-MM-DD format: ")

date1 = pd.to_datetime(date1_str)
date2 = pd.to_datetime(date2_str)


time_diff = date2 - date1

days = time_diff.days
hours = time_diff.seconds // 3600
minutes = (time_diff.seconds // 60) % 60

print(f"The time difference between {date1_str} and {date2_str} is:")
print(f"{days} days, {hours} hours, and {minutes} minutes.")

Q9

In [ ]:

file_path = input("Enter file path: ")

col_name = input("Enter column name: ")

cat_order = input("Enter category order (comma-separated): ").split(",")

df = pd.read_csv(file_path)

df[col_name] = pd.Categorical(df[col_name], categories=cat_order, ordered=True)

df = df.sort_values(col_name)

print(df)

Q10

In [ ]:

import matplotlib.pyplot as plt

file_path = input("Enter file path: ")

df = pd.read_csv(file_path)

grouped_df = df.groupby(['category', 'year']).sum()

pivot_df = grouped_df.pivot_table(values='sales', index='year', columns='category')

ax = pivot_df.plot(kind='bar', stacked=True)

ax.set_title('Sales by Product Category')
ax.set_xlabel('Year')
ax.set_ylabel('Sales')

plt.show()

Q11

In [ ]:
import pandas as pd

file_path = input("Enter the file path of the CSV file containing the student data: ")

df = pd.read_csv(file_path)

mean = df['Test Score'].mean()
median = df['Test Score'].median()
mode = df['Test Score'].mode()

results = pd.DataFrame({
    'Statistic': ['Mean', 'Median', 'Mode'],
    'Value': [mean, median, mode]
})

# Display table
print(results.to_string(index=False))